counterFlowFlame2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    pipeWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       22800;
    }
    outlet
    {
        type            patch;
        nFaces          400;
        startFace       24400;
    }
    inlet
    {
        type            patch;
        nFaces          400;
        startFace       24800;
    }
)

// ************************************************************************* //
